Revit 2026 API

# WireMaterialTypeAddTemperatureRatingType Method

---

Add a new temperature rating type into material type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TemperatureRatingType AddTemperatureRatingType(
	string name,
	TemperatureRatingType baseOn
)
```
```vb
Public Function AddTemperatureRatingType (
	name As String,
	baseOn As TemperatureRatingType
) As TemperatureRatingType
```
```cpp
public:
TemperatureRatingType^ AddTemperatureRatingType(
	String^ name,
	TemperatureRatingType^ baseOn
)
```
```fsharp
member AddTemperatureRatingType :
        name : string *
        baseOn : TemperatureRatingType -> TemperatureRatingType
```

#### Parameters

name String
    Name of temperature type to be added.
baseOn TemperatureRatingType
    The new temperature rating will be created base on this existing temperature rating type.

#### Return Value

TemperatureRatingTypeNew constructed temperature rating type.

#### Reference

WireMaterialType Class

Autodesk.Revit.DB.Electrical Namespace